In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create Data
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]}

In [4]:
# Create Dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [11]:
# Create function
def times1000(x):
    #return x * 1000
    return format (x * 1000, ',d')

In [12]:
# Use Apply Function
my_df["Salary"].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [13]:
# Add Dan Last Name
def namer(x):
    if x == "John":
        return "John Dan"
    else:
        return x

In [15]:
# Show namer()
my_df["Employees"].apply(namer)

0    John Dan
1       April
2         Wes
3        Beth
4      Justin
5       Steph
Name: Employees, dtype: object

In [18]:
# Use Lambda
my_df["Salary"].apply(lambda x: x * 1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [21]:
pd.DataFrame(my_df["Salary"].apply(lambda x: format (x * 1000,',d')))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000